##RTI Data Challenge
This notebook is in reference to the following challenge: https://github.com/rtidatascience/exercises/tree/master/exercise01

###Task 1:
**Write a SQL query that creates a consolidated dataset from the normalized tables in the database. In other words, write a SQL query that "flattens" the database to a single table.**

First things first, let's initialize our connection to the SQLite DB we were provided with.

In [18]:
#Initialize Connection to SQLite Database
import sqlite3
sqlite_file = 'exercise01.sqlite'
conn = sqlite3.connect(sqlite_file)
c = conn.cursor()

Next, we need to do some exploration of the SQLite database to help us understand how to create our flat file.  We can use the code below to figure out how our database has been set up.

In [52]:
#This Code Tells me the Column Names in the SQLite Master Table
c.execute("SELECT * FROM sqlite_master;")
column_names = [description[0] for description in c.description]
print column_names

['type', 'name', 'tbl_name', 'rootpage', 'sql']

Using the above output, we can write a query that shows how each of the database tables were created.  This way, we will be able to figure out how the data needs to be joined to eventually create our flat file.

In [61]:
#Prints the sql column shown above
c.execute("SELECT tbl_name, sql FROM sqlite_master where type = 'table';")
for object in c.fetchall():
    print 'Table Name: ' + object[0]
    print object[1]

Table Name: workclasses
CREATE TABLE workclasses (
	id INTEGER NOT NULL, name TEXT,
	PRIMARY KEY (id)
)
Table Name: education_levels
CREATE TABLE education_levels (
	id INTEGER NOT NULL, name TEXT,
	PRIMARY KEY (id)
)
Table Name: marital_statuses
CREATE TABLE marital_statuses (
	id INTEGER NOT NULL, name TEXT,
	PRIMARY KEY (id)
)
Table Name: occupations
CREATE TABLE occupations (
	id INTEGER NOT NULL, name TEXT,
	PRIMARY KEY (id)
)
Table Name: relationships
CREATE TABLE relationships (
	id INTEGER NOT NULL, name TEXT,
	PRIMARY KEY (id)
)
Table Name: races
CREATE TABLE races (
	id INTEGER NOT NULL, name TEXT,
	PRIMARY KEY (id)
)
Table Name: sexes
CREATE TABLE sexes (
	id INTEGER NOT NULL, name TEXT,
	PRIMARY KEY (id)
)
Table Name: countries
CREATE TABLE countries (
	id INTEGER NOT NULL, name TEXT,
	PRIMARY KEY (id)
)
Table Name: records
CREATE TABLE records (
	id INTEGER NOT NULL, age INTEGER, workclass_id INTEGER, education_level_id INTEGER, education_num INTEGER, marital_status_id INTEGER, occupation_id INTEGER, relationship_id INTEGER, race_id INTEGER, sex_id INTEGER, capital_gain INTEGER, capital_loss INTEGER, hours_week INTEGER, country_id INTEGER, over_50k BOOLEAN,
	PRIMARY KEY (id)
)

It looks like the 'records' table should be our starting point, so let's read it into Pandas.

In [66]:
import pandas as pd
records = pd.read_sql_query("SELECT * from records", conn)
records.head()

,id,age,workclass_id,education_level_id,education_num,marital_status_id,occupation_id,relationship_id,race_id,sex_id,capital_gain,capital_loss,hours_week,country_id,over_50k
0,1,39,8,10,13,5,2,2,5,2,2174,0,40,40,0
1,2,50,7,10,13,3,5,1,5,2,0,0,13,40,0
2,3,38,5,12,9,1,7,2,5,2,0,0,40,40,0
3,4,53,5,2,7,3,7,1,3,2,0,0,40,40,0
4,5,28,5,10,13,3,11,6,3,1,0,0,40,6,0